# cool844ビルドガイド

## 同封されているもの
スイッチプレート　１枚
PCB １枚
M2スペーサー10mm 5個
M2ネジ15mm 5本
ウレタンケーブル25cm

## 別に購入するもの（１）
ダイオード　44本
MXソケット　44個
タクトスイッチ　1個
キースイッチ　44個
キーキャップ
スタビライザー２U ３個
pro micro １個
スプリングピンヘッダ（マックエイトコンスルー）２個
※これらのものについては、遊舎工房、TALP KEYBOARDs、KOCHI KEYBOARDs等国内で自作キーボードに関する部品等を取り扱っているお店で購入することができます。

## 別に購入するもの（２）
マイクロUSB端子（オス）
USB タイプC基板
※これらのものについては、秋月電子で購入することができます。

## 別に購入するもの（3）
ケース
※GH60系60％キーボードケースを使うことを前提になっています。国内では遊舎工房等で、海外ではAli Expresse等で同じようなケースを材質ごとに、見つけることができます。cool844がケース全てに使えるか確認することは、個人の裁量を超えます。購入者の自己責任でお願いします。

## 組み立て

### １　表裏面の確認
スイッチプレートは、表面の右上にcool 844と印字されています。PCB は、diode 、socketと印字されている面が裏面です。

### ２　ダイオードの半田付け
PCB 裏面にダイオードの半田付けをします。画像を参考にダイオードの向きに注意しながら半田付けをしてください。１箇所印字されていないミスが確認できています。それ以外のダイオードの半田付けを参考にして、半田付けをしてください。

### ３　MXソケットの半田付け
PCB 裏面にMXソケットの半田付けをします。PCB 裏面の端子箇所に多めにフラックスを塗布して、予備半田をしてください。MXソケットをsocket と印字を隠すように置いて、ハンダゴテを当てて、予備半田を溶かしながら、半田付けをしてください。
